Revit 2027 API
BuiltInFailures.StairRampFailures.NotALineRiserRamp Property
 Riser line must be a straight line for Ramps.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotALineRiserRamp { get; }
Public Shared ReadOnly Property NotALineRiserRamp As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotALineRiserRamp {
	FailureDefinitionId^ get ();
}
static member NotALineRiserRamp : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace